In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('excel.csv',sep=',')

In [3]:
df.head(3)

,courses_id,student_id,semester,grade,course_name,credits,departments_id,student_name,student_major,student_email,department_name,dep_building
0,81,2440,Spring 2024,A,Ethics and Computer Science and Artificial Int...,1,5,Jeremy Finley,CS,sergiowells@example.org,Mechanical and Aerospace Engineering,Malone Turnpike
1,196,1798,Spring 2024,F,Research in Environmental and Sustainability S...,1,20,Matthew Moore,Physics,shawnjohnson@example.net,Environmental and Sustainability Studies,Brittany Mission
2,183,1698,Fall 2023,D,Principles of Medicine and Biomedical Research,3,16,Shannon Torres,CS,christinesmall@example.org,Medicine and Biomedical Research,Brenda Prairie

In [4]:
Course = df.loc[:,['courses_id','course_name','credits','departments_id']]

In [5]:
Course.head(3)

,courses_id,course_name,credits,departments_id
0,81,Ethics and Computer Science and Artificial Int...,1,5
1,196,Research in Environmental and Sustainability S...,1,20
2,183,Principles of Medicine and Biomedical Research,3,16

In [6]:
Course.columns=['id','course_name','credits','departments_id']

In [7]:
Course.drop_duplicates(subset='id',inplace=True)

In [8]:
len(Course)

200

In [9]:
Student = df.loc[:,['student_id','student_name','student_major','student_email']]

In [10]:
Student.head(3)

   student_id    student_name student_major               student_email
0        2440   Jeremy Finley            CS     sergiowells@example.org
1        1798   Matthew Moore       Physics    shawnjohnson@example.net
2        1698  Shannon Torres            CS  christinesmall@example.org

In [11]:
Student.columns=['id','student_name','student_major','student_email']

In [12]:
Student.drop_duplicates(subset='id',inplace=True)

In [13]:
len(Student)

4752

In [14]:
Student.head(3)

     id    student_name student_major               student_email
0  2440   Jeremy Finley            CS     sergiowells@example.org
1  1798   Matthew Moore       Physics    shawnjohnson@example.net
2  1698  Shannon Torres            CS  christinesmall@example.org

In [15]:
Department = df.loc[:,['departments_id','department_name', 'dep_building']]

In [16]:
Department.columns=['id','department_name', 'dep_building']

In [17]:
Department.drop_duplicates(subset='id',inplace=True)

In [18]:
len(Department)

20

In [19]:
Department.head(3)

   id                           department_name      dep_building
0   5      Mechanical and Aerospace Engineering   Malone Turnpike
1  20  Environmental and Sustainability Studies  Brittany Mission
2  16          Medicine and Biomedical Research    Brenda Prairie

In [20]:
Course_Student = df.loc[:,['semester','grade','student_id','courses_id']]

In [21]:
Course_Student.insert(0, 'id', range(1,len(Course_Student) + 1))

In [22]:
Course_Student.columns=['id','semester','grade','student_id','courses_id']

In [23]:
Course_Student.head(3)

   id     semester grade  student_id  courses_id
0   1  Spring 2024     A        2440          81
1   2  Spring 2024     F        1798         196
2   3    Fall 2023     D        1698         183

In [24]:
# Check which department IDs actually exist
existing_depts = Department['id'].unique()
print("Existing department IDs:", sorted(existing_depts))

# Find which IDs in your data are missing
missing_depts = set(df['departments_id'].unique()) - set(existing_depts)
print("Missing department IDs:", sorted(missing_depts))

Existing department IDs: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
Missing department IDs: []

In [25]:
# Create a DataFrame with missing departments (example)
missing_data = pd.DataFrame({
    'id': [1, 2, 3],  # Add all missing IDs
    'department_name': ['Unknown Dept 1', 'Unknown Dept 2', 'Unknown Dept 3'],
    'dep_building': ['TBD'] * 3
})

# Add to Department table
Department = pd.concat([Department, missing_data]).drop_duplicates('id')

In [26]:
from sqlalchemy import create_engine

In [27]:

engine = create_engine('sqlite:///DB3.db')

In [28]:
Student.to_sql('Student', con =engine, if_exists='replace', index=False)

4752

In [29]:
Course.to_sql('Course', con =engine, if_exists='replace', index=False)

200

In [30]:
Department.to_sql('Department', con =engine, if_exists='replace', index=False)

20

In [31]:
Course_Student.to_sql('Course_Student', con =engine, if_exists='replace', index=False)

15000

In [32]:
engine.dispose()